[
  {
    "imgSrc": "/mail-man.jpg",
    "imgAlt": "HTML form submission",
    "title": "HTML form submission",
    "desc": "A complete solution to HTML form submissions. Leveraging serverless for efficiency and reliability.",
    "sidebarData": {
      "title": "HTML form submission",
      "paraMain": "A service which allows form submissions direct from html forms AND via rest API. We allow users to sign up, which registers an email address and an access token which they can use to interact with the service. Currently all users are on a free tier which limits their monthly submissions, but soon an integration with Stripe should allow the introduction of multiple subscription levels.",
      "imgSrc": "/mail-man.jpg",
      "imgAlt": "Email submission service",
      "paraAlt": "From a tech side this project has been super interesting for me because although I’ve used the tech stack before it’s the first time I have rolled it all up into one. Noteworthy mentions include Typescript, Terraform, AWS Cognito and Stripe.",
      "href": " https://www.easycontactform.dev",
      "hrefTitle": "www.easycontactform.dev",
      "hrefText": "www.easycontactform.dev"
    }
  },
  {
    "imgSrc": "/site-map.jpg",
    "imgAlt": "NextJs generated Sitemap",
    "title": "NextJs generated Sitemap",
    "desc": "You need to generated a sitemap in your pipeline!",
    "sidebarData": {
      "title": "NextJs generated Sitemap",
      "paraMain": "I have made the mistake of manually creating sitemaps in the past. I no longer feel like it's a good use of time so I put it into the build pipeline of my projects these days.",
      "imgSrc": "/site-map.jpg",
      "imgAlt": "NextJs generated Sitemap",
      "paraAlt": "I created a video of me adding just such a feature into a NextJS website I created a while back.",
      "href": " https://youtu.be/zS-6oiwvNnc",
      "hrefTitle": "YouTube video",
      "hrefText": "YouTube video"
    }
  },
  {
    "imgSrc": "/nextjs-logo.png",
    "imgAlt": "Next JS",
    "title": "NextJs website",
    "desc": "Full build website utilising Node, React and NextJs.",
    "sidebarData": {
      "title": "NEXT.js",
      "paraMain": "A full website build using the NEXT.js framework. This technology allows for fast and straight forward development using Node and React. NEXT handles alot out of the box and provides a great foundation to build from.",
      "imgSrc": "/nextjs-logo.png",
      "imgAlt": "Next JS",
      "paraAlt": "A useful feature you may notice in this build is the usage of customEvents with ProjectTile components. The slide out sidebar listens for an event which has all the data it needs to be populated with attached. This allows the sidebar component to be completely decoupled from the ProjectTiles",
      "href": "https://github.com/michaelCaleyWhaley/caley-code-lab-website",
      "hrefTitle": "NEXT.js project link",
      "hrefText": " Project link"
    }
  },
  {
    "imgSrc": "/flashlight_night.jpg",
    "imgAlt": "Torch light animation",
    "title": "Torch light",
    "desc": "Code snippet showcasing a torch effect users can interact with.",
    "sidebarData": {
      "title": "Torch light",
      "paraMain": "This code snippet was inspired from a similar effect I saw on Codepen which I felt had been down in an overly complicated way (Unfortunately, at the time of writing the original inspiration is lost to me).",
      "imgSrc": "/flashlight_night.jpg",
      "imgAlt": "Night time torch light",
      "paraAlt": "In this version a very simple setup is required. A container with a background image, and a child which is position absolute, and twice the width and height of the parent. The child has a radial-gradient background which allows it to be completely dark with the exception of a circle at the centre. On mouse over you simply move the centre of the child to the mouse coordinates.",
      "href": "https://codepen.io/mikeCaley/pen/xxKpNeQ",
      "hrefTitle": "Torch light codepen link",
      "hrefText": " Project link"
    }
  },
  {
    "imgSrc": "/squares.jpg",
    "imgAlt": "square pattern",
    "title": "3D CUBES",
    "desc": "Responsive 3D cubes using CSS and JS",
    "sidebarData": {
      "title": "3D CUBES",
      "paraMain": "Whilst investigating the usage of canvas I wondered how difficult it would be to create 3D objects using purely elements in the DOM. A quick search revealed nothing quite like what I had in mind, and nothing responsive. Initial attempts were pure CSS, however I realised that we had no access to responsive values on the Z plane in CSS so had to bring JavaScript in to do some of the computational lifting.",
      "imgSrc": "/squares.jpg",
      "imgAlt": "square patten",
      "paraAlt": "Some time has passed since I created this project so when I look back now, I see areas requiring improvement, such as the structure of the JS. However, I believe the look and functional of the cubes is good and is still of interest. ",
      "href": "https://codepen.io/mikeCaley/full/evaEyr",
      "hrefTitle": "codepen 3D cube link",
      "hrefText": " Project link"
    }
  }
]
